/* Дан некоторый URL: String url = "http://test.com/dir1/dir2/dir3/page.html";
Даны переменные:
int num = 2;
String val = "eee";
Замените в URL папку с номером num на значение val: "http://test.com/dir1/eee/dir3/page.html" */

public class TenSixThree {
   public static void main(String[] args){
       System.out.println("В процессе");
   }
}